let carrData = [
    {
        name: 'Самоїдська лайка',
        model: 'Росія',
        year: "добра та безтурботна",
        color: 'білий',
        price: "1 000,00 грн – 12 000,00 грн",
        image: 'layka2.jpeg',
        about: "ріст самоїдської лайки - 53-60 см, а середня вага - 20-25 кг. Середнього розміру мордочка звужується до носа. Трохи розкосі очі випромінюють добро та якусь хитринку. Відмінною особливістю пухнастих красенів є характерна усмішка, що надає їм шарм і чарівність.",
    },
    { name: 'Чихуахуа', model: 'Мексика', year: " Рухливий, Агресивний, Пильний, Швидкий, Люблячий, Сміливий", price: '4 000,00 грн – 15 997,00 грн', color: 'Чорний колір, Білий колір, Fawn, Шоколадний, Cream, Золотий', image: 'chihya.jpeg', about: 'Це компактна собака з квадратним форматом. У сук трохи розтягнутий формат. Голова має характерну яблукоподібну форму. Морда коротка, широка біля основи, трохи звужується до носа.', },
    { name: 'Доберман', model: '  Німечина та Тюрингія', year: ' Тямущий, Покірний, Енергійний, Пильний, Відданий, Безстрашний, Впевнений в собі', price: '4 500,00 грн – 56 126,00 грн', color: 'Чорний колір, Білий колір, Fawn, Red & Rust, Black & Rust, Blue & Rust, Fawn & Rust, Червоний, Blue', image: 'doberman.jpeg', about: 'До́берман, або тюринзький пінчер — порода короткошерстих службових собак, виведена в Німеччині, у Тюрингії, у місті Апольда наприкінці XIX століття Карлом Фрідріхом Луїсом Доберманом, названа на честь свого творця. ', },
    { name: "Йоркшир-тер'єр ", model: 'Англія', year: "Тямущий, Хоробрий, Впевнений в собі, Самостійний, Сміливий",price:'3 000,00 грн – 40 137,00 грн ', color:' Blue & Tan, Blue & Gold, Black & Tan, Black & Gold', image: 'york2.jpeg', about: "Йоркшир-тер'єр, або скор. йорки — мисливська, виставкова і кімнатна порода собак, виведена в Англії, графстві Йоркшир наприкінці XIX ст. для боротьби з гризунами. Весела вдача і чудовий вигляд сприяють популярності цих «живчиків».", },
    { name: 'Сибірський хаскі ', model: 'Сибір', year: 'Тямущий, Дружній, Пильний, Компанійський, Лагідний', price: '3 800,00 грн', color: 'Білий колір, Чорний колір, Gray & White, Sable & White, Black & Tan, Silver-gray, Red & White, Black & White, Grey', image: 'haski.jpeg', about: 'Сибірський хаскі — порода собак, заводська спеціалізована порода, отримана американськими кінологами у 30-х роках 20-го століття, як їздова собака.', },
    { name: 'Померанський шпіц', model: 'Німеччина, Польща', year: 'Грайливий, Екстравертований, Тямущий, Дружелюбний, Рухливий, Дружній, Aктивний', price: '3 000,00 грн – 26 000,00 грн', color: 'Білий колір, Чорний колір, Синій колір, Червоний колір, Кремовий колір, Grey-shaded, Tan, Orange, Brown', image: 'shpis.jpeg', about: 'Померанський шпіц — декоративна порода собак. Належить до групи шпіців. Деякі кінологічні федерації розглядають померанських шпіців як різновид німецького шпіца, інші виділяють його в окрему породу. ' , },

]

let carrApp = {
    data() {
        return {
            cars: carrData,
            currentCar: carrData[0],
            currentIndex: 0,
        }
    },
    methods: {
        showCar(index) {
            this.currentCar = carrData[index];
            this.currentIndex = index;
        }
    },
}
Vue.createApp(carrApp).mount('#vue-cont')